# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

def to_bin(x):
    res = 0
    mult = 1
    while x > 0:
        res += x % 2*mult
        x //= 2
        mult *= 10
    return res


num = int(input('Введите десятичное число: '))

print(f'{num} в двоичном виде -> {to_bin(num)}')

#  2 варивнт, с помощью встроенной функции
print(bin(num)[2:])
